demo-output/website/dafoam/rans_model_comparison/kOmega/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inflow
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          3025;
        startFace       5940;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outflow;
    }
    outflow
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          3025;
        startFace       8965;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inflow;
    }
    wallTop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          55;
        startFace       11990;
    }
    wallSide
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          55;
        startFace       12045;
    }
    symmetryBottom
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          55;
        startFace       12100;
    }
    symmetrySide
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          55;
        startFace       12155;
    }
)

// ************************************************************************* //
