demo-output/website/dafoam/rans_model_comparison/kOmega/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType RAS;

RAS
{
    RASModel        kOmega;
    turbulence      on;
    printCoeffs     on;
}
